# Spacing Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
LayoutRuleClearSpacing..::..Spacing Property
LayoutRuleClearSpacing Class See Also
---
Get or set the spacing of the beam system.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Spacing { get; set; }
```

Visual Basic
---
```text
Public Property Spacing As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Spacing {
	double get ();
	void set (double value);
}
```

# Remarks
The value of spacing must be in [0, 30000), but in fact the spacing should not be too small or too great.
# See Also
LayoutRuleClearSpacing Class
Autodesk.Revit.DB Namespace